import 'package:flutter/material.dart';

 
class character extends StatelessWidget {
  final List myImageData = [
    'character/KudoChiniji&AdongawaConan.jpg',
    'character/AraideTomoargi.jpg',
    'character/Back G.jpg',
    'character/Belmot.jpg',
    'character/Berbon.jpg',
    'character/Chato Miwago.jpg',
    'character/Detective Children.jpg',
    'character/DrAkasa Hiroshi.jpg',
    'character/Gon 2.jpg',
    'character/Gon.jpg',
    'character/Hibara I.jpg',
    'character/Hondo Asuge.jpg',
    'character/Huntori Heychi.jpg',
    'character/Jame Back.jpg',
    'character/jodie starling.jpg',
    'character/Kaoygokhu Makoto.jpg',
    'character/Kian.jpg',
    'character/Kid.jpg',
    'character/Kisagi Ari.jpg',
    'character/Kojima Genta.jpg',
    'character/Kudo Ugigo.jpg',
    'character/Kudo Ushagu.jpg',
    'character/Kuroba Kaito.png',
    'character/Mengure Chuso.jpg',
    'character/Miyamoto Umi.jpg',
    'character/Mori Kogoro.jpg',
    'character/Mori Run.jpg',
    'character/Nakamouri Ginsho.jpg',
    'character/Seuseugi Shonogo.jpg',
    'character/Shiba Keshi.jpg',
    'character/Shiburaya Mishihiko.jpg',
    'character/Shiratori Ninshaburo.jpg',
    'character/Sumiko Kobayashi.png',
    'character/Takangi Wataru.jpg',
    'character/Toyama Kazuha.jpg',
    'character/Toyama.jpg',
    'character/Wodga.jpg',
    'character/Yin.jpg',
    'character/Yoshida Aumi.jpg',

  ];
  final List nameThai = [
    'คุโด้ ชินอิจิ',
    'อาราอิเดะ โทโมอากิ',
    'องค์กรชุดดำ',
    'เบลม็อท',
    'เบอร์บอน',
    'ซาโต้ มิวาโกะ',
    'นักสืบเยาวชน',
    'ดร.อากาสะ ฮิโรชิ',
    'กอร์น',
    'มิยาโนะ อาเคมิ',
    'ไฮบาระ ไอ',
    'ฮอนโด เอย์สึเกะ',
    'ฮัตโตริ เฮย์จิ',
    'เจมส์ แบล็ก',
    'โจดี้ สตาร์ลิ่ง',
    'เคียวโกขุ มาโคโตะ',
    'เคียนติ',
    'จอมโจรคิด',
    'คิซากิ เอริ',
    'โคจิมะ เก็นตะ',
    'คุโด้ ยูกิโกะ',
    'คุโด้ ยูซากุ',
    'คุโรบะ ไคโตะ',
    'เมงูเระ จูโซ',
    'มิยาโมโต้ ยูมิ',
    'โมริ โคโกโร่',
    'โมริรัน',
    'นากาโมริ กินโซ',
    'ซึซึกิ โซโนโกะ',
    'ชิบะ เคย์จิ',
    'ซึบุรายะ มิซึฮิโกะ',
    'ชิราโทริ นินซาบุโร่',
    'โคบายาชิ ซึมึโกะ',
    'ทาคางิ วาตารุ',
    'โทยามะ คาซึฮะ',
    'สารวัตรโทยามะ',
    'วอดก้า',
    'ยิน',
    'โยชิดะ อายูมิ',

  ];
  final List mytext = [
    '       คุโด้ ชินอิจิ ชินอิจิเป็นนักสืบมัธยมปลายปีที่ 5 ห้อง B โรงเรียนมัธยมปลายเทตัน ที่มีชื่อเสียง ได้รับขนานนามว่าผู้กอบกู้วงการตำรวจญี่ปุ่น, ยอดนักสืบแห่งตะวันออก, และ เชอร์ล็อก โฮล์มส์แห่งยุคเฮย์เซ เป็นลูกชายเพียงคนเดียวของ คุโด้ ยูซากุ และคุโด้ ยูกิโกะ เกิดเมื่อวันที่ 4 พฤษภาคม อาศัยอยู่ที่เมืองเบกะ หมู่ 2/21 วันหนึ่ง ชินอิจิได้พาโมริ รัน เพื่อนสมัยเด็กไปยังสวนสนุกทรอปิคอลแลนด์ เพื่อฉลองชัยชนะคาราเต้ระดับเขตของเธอ ชินอิจิได้ไขคดีฆาตกรรมที่เกิดขึ้นบนรถไฟเหาะได้ หลังจากที่กำลังจะกลับบ้าน ชินอิจิได้ขอตัวรัน เพื่อตามชายชุดดำต้องสงสัย วอดก้า ชินอิจิได้เห็นการขู่กรรโชกระหว่างวอดก้า และประธานบริษัทนอกสวนสนุก หลังจากนั้นไม่นานยีน ชายชุดดำอีกคนได้ตีหัวชินอิจิจนล้มจากด้านหลัง หลังจากนั้นยีนได้จับกรอกยาพิษ APTX4869 หวังให้ชินอิจิตาย แต่ชินอิจิกลับไม่ตาย แต่ร่างกายกลับตัวเล็กลงเป็นเด็ก เมื่อชินอจิได้สติกลับมาจึงรีบกลับบ้าน และปรึกษาดร.อากาสะ ฮิโรชิ นักวิทยาศาสตร์ข้างบ้านตน โดยอากาสะได้แนะนำให้ชินอิจิไปอยู่บ้านของรัน หรือสำนักงานนักสืบโมริ และปิดเงียบความลับเอาไว้ไม่ให้ใครรู้ รันได้มาหาชินอิจิที่บ้านด้วยความเป็นห่วง และได้เห็นชินอิจิที่ตัวเล็กลง ชินอิจิเหลือบไปเห็นหนังสือนวนิยายด้านหลัง ที่มีชื่อนักเขียนชื่อดังอย่าง เอโดงาวะ รัมโป และ อาร์เธอร์ โคนัน ดอยล์ โคนันจึงตอบรันไปว่าตนชื่อ เอโดงาวะ โคนัน และเพื่อสืบข่าวคราวของชายชุดดำ โคนันจึงไปอาศัยอยู่กับ รัน และ โมริ โคโกโร่ พ่อของเธอที่เป็นนักสืบเอกชน โคนันต้องกลับมาเรียนชั้นประถมศึกษาใหม่ เพื่อปกปิดความจริงของเขา และได้รู้จักกับ โคจิมะ เก็นตะ, ซึบุรายะ มิซึฮิโกะ, และ โยชิดะ อายูมิ จึงได้ก่อตั้งขบวนการนักสืบเยาวชนขึ้น เนื่องด้วยโคนันจำเป็นต้องให้โคโกโร่มีชื่อเสียง เพื่อที่จะมีผู้ว่าจ้างให้ทำคดีเกี่ยวกับองค์กรชุดดำ โคนันจึงต้องช่วยคลี่คลายคดีด้วยอุปกรณ์หลัก 2 ชิ้น คือหูกระต่ายเปลี่ยนเสียง และ นาฬิกายิงยาสลบ จนทำให้คนทั่วไปรู้จักในนามว่า โคโกโร่นิทรา เพราะเวลาคลี่คลายคดีจะทำท่าเหมือนกำลังนอนหลับ',
    '       หมอประจำโรงเรียนมัธยมเทตัน เป็นบุตรชายของ อาราอิเดะ โยชิเทรุ หมอที่โมริ โคโกโร่เคยไปตรวจ ซึ่งพ่อของเขาถูกฆาตกรรมโดยแม่เลี้ยงของเขาเอง ปรากฏตัวครั้งแรกเล่มที่ 24 File 3 ตอน อีกครึ่งปี หรือตอนที่ 170-171 จุดบอดในความมืด เคยถูกองค์กรชุดดำปองร้ายจนต้องย้ายบ้านไปอยู่นอกเมือง(และระหว่างนั้น เบลม็อต ขององค์กรชุดดำก็ปลอมตัวมาเป็นเขาแทน [รายละเอียดติดตามได้ในเล่ม 42 หรือตอนที่ 345])',
    '       องค์กรชุดดำ เป็นกลุ่มองค์กรก่อการร้าย และเป็นคนทำให้คุโด้ ชินอิจิ ต้องเปลี่ยนสภาพกลับกลายเป็นเด็ก คนที่ทำให้คุโด้เป็นเด็กมีโค้ดลับว่า "ยิน" และ"วอดก้า" แต่มีหัวหน้าที่ไม่มีใครรู้ พวกเขาพบกันโดยบังเอิญที่ ทรอปิคอลแลนด์ ขณะกำลังเล่นรถไฟเหาะมีคดีเกิดขึ้น พอจบคดี คุโด้ก็ยังสงสัยพวกเขาอยู่ จึงไปเห็นการแลกเปลี่ยนสิ่งของกัน จนโดนทำร้ายและได้รับยา APTX4869 ในกลุ่มนี้ ชื่อโค้ดเนมจะมาจากชื่อเหล้า เช่น ชื่อเหล้ายิน เตกีล่า เป็นชื่อเหล้าเตกีล่า วอดก้า เป็นชื่อเหล้าวอดก้า นอกจากนี้ยังมี เชอรี่ (โค้ดเนมของ มิยาโนะ ชิโฮ หรือ ไฮบาระ ไอ)ซึ่งเป็นผลไม้ที่นิยมกินกับเหล้าสำหรับค็อกเทล',
    '       เบลม็อท หรือ คริส วินยาร์ด เป็นลูกสาวของ ''ชารอน วินยาร์ด''นักแสดงสาวยักษ์ใหญ่ มีความสามารถในการปลอมตัวได้อย่างแนบเนียน เธอเป็นผู้ฆ่าพ่อของ โจดี้ นักสืบสาวจาก เอฟบีไอหลังจากนั้นได้รู้ว่าเธอเป็นคนๆเดียวกับแม่ของเธอ จากการตรวจรอยนิ้วมือที่ติดอยู่ที่แว่นซึ่งถูกคริสเก็บเพราะหล่นอย่างไม่เป็นธรรมชาติ เธอรู้ตัวจริงของชินอิจิแต่พยายามปิดบังองค์กรไว้ เหตุผลอาจจะเป็นประโยคที่ชินอิจิพูดไว้ตอนช่วยเธอที่ปลอมเป็นฆาตกรโรคจิตตอนกำลังจะตกจากตึกร้างในนิวยอร์กว่า'' การที่คนช่วยคนน่ะ มันไม่มีเหตุผลหรือทฤษฎีอะไรมาอธิบายได้หรอก',
    '       เบอร์บอนเป็นสมาชิกใหม่ขององค์กรชุดดำ ซึ่งมีสายตาหลักแหลม สังเกตการณ์ได้ดี เป็นคนชอบทำอะไรเป็นความลับเหมือนกับเบลม็อท ตัวจริงของเขาเป็น โทโอรุ อามุโระ ตอนนี้ป้วนเปี้ยนอยู่รอบๆตัวโคนัน ทำงานที่ร้านปัวร์โร และกำลังสงสัยเรื่องของโคนันอยู่',
    '       ตำรวจสาวแห่งกรมตำรวจญี่ปุ่น สูง 165 ซม. เป็นที่เนื้อหอมในหมู่ตำรวจหนุ่มๆทั้งหลาย แต่เธอก็ไม่เคยสนใจใคร เพราะเคยมีอดีตที่เจ็บช้ำจากการสูญเสียคนรัก จนกระทั่งรู้จักกับ ทาคางิ วาตารุ ที่ทำให้เธอเปิดหัวใจอีกครั้ง มิวาโกะค่อนข้างทึ่งในความสามารถของโคนันและรับฟังการวิเคราะห์คดีของเขาเสมอ แม้ใครจะมองว่าโคนันเป็นเด็ก แต่เธอกลับรู้สึกว่าโคนันฉลาดกว่าเด็กทั่วไป มีรถสปอตสีแดงรุ่น เมื่อสมัยก่อนเธอใช้รถสีขาว แต่พอเกิดอุบัติเหตุขึ้นเลยเปลี่ยนสีรถ แท้จริงแล้ว เจ้าของคดีแม่มดสีเงินบนเขาฟุยุนะก็คือเธอนี่แหละ ที่คนอื่นได้ยินว่าเป็นเสียงยางบดกับถนนจนเป็นเสียงแหลม จริงๆแล้วมันคือเสียงกรีดร้องของเธอเองเวลาต้องหักเลี้ยวพวงมาลัยกะทันหัน',
    '       ขบวนการนักสืบเยาวชน เป็นกลุ่มเพื่อนๆ เด็กประถมของโคนัน ทั้ง 4 คน ซึ่งมี เก็นตะ, อายูมิ, มิซึฮิโกะ และ ไอ ทั้ง 5 คนจะมีวิทยุติดต่อกันซึ่งได้มาจากดอกเตอร์ อากาสะ',
    '       นักวิทยาศาสตร์เพื่อนบ้านของชินอิจิ อายุ 52 ปีและยังเป็นเพื่อนกับพ่อของชินอิจิ อยู่บ้านเลขที่ 22 หมู่ 2 เบกะโจ เขาคอยช่วยเหลือโคนันทุกๆเรื่อง ตั้งแต่เรื่องที่ชินอิจิกลายเป็นโคนัน เขาก็พยายามหายาแก้พิษด้วย นอกจากนี้เครื่องมือที่ช่วยเหลือโคนันในการคลี่คลายคดี ดร.อากาสะก็เป็นคนประดิษฐ์ และยังชอบใบอิโจมาก เนื่องจากมีความหลังกลับเด็กผู้หญิงที่ชื่อ คิโนะชิตะ ฟุซาเอะ ซึ่งเป็นรักแรกของดร.อากาสะ และเธอจะมารอดร.ทุกสิบปีใต้ต้นอิโจสถานที่แห่งความหลัง ตอนนี้เธอเป็นเจ้าของแบรนด์ชื่อดัง ที่เคยสัญญากับรันตอนอยู่ป.1ที่ให้ยืมร่มว่า "ถ้าโตขึ้นจะต้องซื้อของของฟุซาเอะแบรนด์" (ซึ่งรันก็ได้ทำตามสัญญาจริงๆในตอน รักครั้งแรกสีใบอิโจ)',
    '       นักลอบสังหารฝีมือดีขององค์กรชุดดำ ปฏิบัติภารกิจเป็นคู่กับเคียนติ เกลียดเบลม็อทเป็นที่สุดเพราะทำให้คาลวาโดสที่หลงรักเบลม็อทจนถูกหลอกและทำให้คาลวาโดสตายในที่สุด',
    '       มิยาโนะ อาเคมิ เป็นพี่สาวของมิยาโนะ ชิโฮะ (หรือไฮบาระ ไอ) เธอใช้ชื่อปลอมว่า ฮิโรตะ มาซามิ ซึ่งเป็นชื่อของอาจารย์มหาวิทยาลัยที่เธอเรียนมา ทำงานอยู่ในองค์รชุดดำเหมือนกัน แต่อยู่ปลายแถวขององค์กร ปรากฏครั้งแรกในเล่มที่ 2 เป็นคนร้ายปล้นธนาคารเป็นเงินพันล้านเพื่อนำไปแลกกับตัวน้องสาวของเธอกลับคืนมา และถูกฆ่าตายในที่สุด แต่เงินที่ปล้นมาได้ก่อนที่อาเคมิจะตายได้บอกให้โคนันป้องกันไว้อย่าให้พวกองค์กรชุดดำเอาไป และถูกองค์กรฆ่าตาย และการตายของเธอตำรวจสรุปว่าฆ่าตัวตายเพราะสำนึกบาป ในภาคอะนิเมะ ตอนนี้จะตรงกับตอนที่ 13 แต่ในภาคอะนิเมะนี้ จะมีการปรับเปลี่ยนเนื้อหา โดยคนที่อยู่เบื้องหลังนั้น ไม่ใช่ชายชุดดำ แต่เป็นชายที่ชื่อ โอคิตะ และมิยาโนะ อาเคมิ ไม่ได้ถูกฆ่าตายในตอนนี้ แต่จะมีอีกตอนหนึ่งในภาคอะนิเมะ ซึ่งเนื้อหาในตอนท้าย จะตรงกับในภาคมังงะ เล่มที่ 2(คือพบกับยีนและว็อดก้า และถูกฆ่าตายในที่สุด) โดยในภาคอะนิเมะนั้น จะตรงกับตอนที่ 135 ซึ่งมีเนื้อหาเกี่ยวกับการปล้นเงินจากธนาคารเหมือนกัน มิยาโนะ อาเคมิ เคยคบกับ โมโรโบชิ ได(ชื่อปลอมของอากาอิ ชูอิจิ ตอนที่แฝงตัวเข้าไปสืบข่าวในองค์กร)แต่ได้เมล์ไปหาอากาอิ ชูอิจิว่า ถ้าสามารถถอนตัวออกจากองค์กรได้จะยอมคบเป็นแฟนจริงๆ แต่อาเคมิก็ถูกยินฆ่าตายก่อน',
    '       ไฮบาระ ไอ หรือในชื่อจริง มิยาโนะ ชิโฮะ เป็นตัวละครจากการ์ตูนญี่ปุ่นเรื่อง ยอดนักสืบจิ๋วโคนัน เดิมชิโฮะเป็นหนึ่งในอดีตสมาชิกขององค์กรชุดดำ ที่มี โค้ดเนม ว่า เชอรี่ (Sherry)และเป็นผู้คิดค้นและพัฒนายา APTX4869 ที่ทำให้ คุโด้ ชินอิจิ และตัวเธอเองตัวหดเล็กลง แต่ต่อมาเธอก็ได้ทรยศองค์กรและหนีออกมาอาศัยร่วมอยู่กับ อากาสะ ฮิโรชิ ตามคำแนะนำของ คุโด้ ชินอิจิ ซึ่งภายหลังกลายร่างเป็น เอโดงาวะ โคนัน เนื่องจากยาพิษ APTX4869[1] ที่เธอทำขึ้น เพื่อที่จำให้เธอทำยาแก้พิษขึ้น จนถึงขณะนี้องค์กรชุดดำก็ยังคงตามล่าเธอที่หนีออกมาได้เพื่อกำจัดเธอ ในขณะเดียวกันเธอก็ช่วยโคนันไขคดีพร้อมกับพยายามหาข้อมูลเกี่ยวกับเรื่องยาถอนพิษ APTX4869 อยู่',
    '       เป็นลูกชายของอีธาน และเป็นน้องชายของฮิเดมิ เขาเป็นลูคีเมีย เขาไม่ชอบอะไรที่มามีบีปคั้นเขา มีเลือดกรุ๊ป O (ภายหลังเปลี่ยนเป็น AB จากการรับผ่าตัดโรคลูคีเมีย โดยใช้ไขกระดูกของพี่ ซึ่งมีเลือดกรุ๊ป AB) เป็นคนหนึ่งที่รู้ตัวจริงของโคนัน',
    '       ฮัตโตริ เฮย์จิ นักสืบ ม.ปลายผู้มีชื่อเสียงในแถบคันไซ โอซาก้า สูง 171 ซม. เล่นกีฬาเคนโด้และเป็นเด็กม.ปลายคนดังที่สามารถเอาชนะคนดังระดับจังหวัดโอซาก้ามาก่อน หากชินอิจิเป็นนักสืบแห่งตะวันออก เฮย์จิก็จะเป็นนักสืบแห่งตะวันตก เฮย์จิปรากฏตัวครั้งแรกในเล่มที่ 10 หรือภาคอะนิเมะ ตอนที่ 48-49 คดีฆาตกรรมนักการทูต โดยเป็นมาโตเกียวและถามว่า "คุโด้อยู่ไหน" ตอนที่เจอกับเฮย์จิ โคนันเป็นหวัดและดื่มเหล้าขาวเข้าไป จึงคืนร่างเป็นชินอิจิ และคลี่คลายคดีเอาชนะเฮย์จิได้อย่างสวยงาม ในตอนหลังเฮย์จิเริ่มรู้สึกว่าโคนันแปลกจากเด็กทั่วไป จนรู้ความลับที่ว่าโคนันคือชินอิจิ (จากตอนที่ 59-60 คดีฆาตกรรมคนบ้าโฮมส์) และกลายมาเป็นเพื่อนและคู่หูที่ดีต่อกัน',
    '       เจมส์ แบล็ก เขามาที่ประเทศญี่ปุ่นเพื่อสืบหาคนร้าย และเป็นหัวหน้าของหน่วยเอฟบีไอ ลูกทีมของเขาคือ อากาอิ ชูอิจิ โจดี้ เชนท์มิลเลี่ยน และ แอนดอล คาเมล',
    '       โจดี้ สตาร์ลิ่ง มาจากประเทศสหรัฐอเมริกา มาที่ประเทศญี่ปุ่นเพื่อสืบหาคนร้าย ที่ทำการฆาตกรรมพ่อและแม่ของเธอ ร่วมกับเหล่าเอฟบีไอ โดยปลอมตัวเป็นอาจารย์เข้ามาสอนในโรงเรียนมัธยมปลายเทตัน และเพื่อเล่นเกมตู้ เธอเรียกโคนันว่า คูลคิดส์ และเคยเห็นรูป ชิโฮ ที่หน้าตาคล้ายไฮบาระ ไอ ก็เลยแอบสืบตัวจริงอยู่นั้นเองแต่มีคนสันนิษฐานว่าเป็นพวกของชายชุดดำ พ่อของโจดี้ เซนต์มิลเลี่ยนนั้น ถูกฆ่าโดย เบลม็อท (คริส วินยาร์ด) ซึ่งหลังจากนั้นเธอได้ขอร้องเอฟบีไอ ให้เธอเข้าไปร่วมงานด้วย ฮัตโตริ เฮย์จิสงสัยเธอว่า ฟังภาษาญี่ปุ่นออกแท้ๆ แต่เธอกับพูดไม่ชัด(ตอน ครูสอนภาษาอังกฤษ vs ยอดนักสืบตะวันตก )',
    '       เคียวโกขุ มาโคโตะ ปรากฏตัวครั้งแรกในภาคแอนิเมชั่นในตอน หน้าร้อนอันตรายของโซโนโกะ เป็นลูกชายเจ้าของโรงแรมแห่งหนึ่ง เป็นกัปตันคาราเต้ของโรงเรียนไคโด้ เขาได้ช่วยโซโนโกะจากคดีนั้นไว้ เลยได้มาเป็นแฟนกัน หลังจากนั้นก็ไปศึกษาต่อที่ต่างประเทศ',
    '       เคียนติ เป็นนักลอบสังหารฝีมือดีขององค์กรชุดดำเช่นกัน ปฏิบัติภารกิจคู่กับกอร์น เกลียดเบลม็อทเป็นที่สุดเพราะทำให้คาลวาโดสที่หลงรักเบลม็อทจนถูกหลอกและทำให้คาลวาโดสต้องฆ่าตัวตายในที่สุด',
    '       จอมโจรคิด ในชื่อจริง คุโรบะ ไคโตะ เป็นลูกชายคนเดียวของคุโรบะ โทอิจิ นักมายากลชื่อก้องโลก คุโรบะไคโตะนั้นเป็นคิดรุ่น 2 ต่อจากพ่อของเขา มีความสามารถในการปลอมตัวทั้งเสียงและอุปนิสัยของคน ๆ นั้น ส่วนคุโระบะ โทอิจิที่เป็นคิดรุ่นแรก ว่ากันว่าเป็นอาจารย์สอนวิชาปลอมตัวให้กับแม่ของคุโด้และชารอน วินยาร์ด จอมโจรคิดในตอนแรกปรากฏในชื่อ จอมโจร 1412 ตัวเลข 1412 เป็นรหัสของเขา และคนที่ตั้งชื่อคิดขึ้นมาก็คือ คุโด้ ยูซากุ โดยเป็นการเล่นคำจากรหัส 1412 ที่เขียนด้วยลายมือของนักหนังสือพิมพ์',
    '       คิซากิ เอริ เป็นแม่ของรัน เป็นคู่กัดกับโมริ โคโกโร่ตั้งแต่เด็ก เกลียดนิสัยของโคโกโร่ ตอนนี้จึงแยกกันอยู่ เป็นคนสุขุม เยือกเย็น หัวดี ทำงานเป็นทนายความ ฉลาด เก่ง ว่าความคดีไหนๆก็ชนะทุกราย จนได้รับฉายาว่า "ควีนแห่งวงการกฎหมาย" สมัยอยู่โรงเรียนเทตันเธอได้ฉายาว่า"ราชินีแห่งเทตัน" ซึ่งเป็นคู่แข่งกับ คุโด้ ยูกิโกะ ที่ได้ฉายาว่า"เจ้าหญิงแห่งเทตัน" (จากเล่มที่ 40-41 หรือตอนที่ 333-334) แยกทางกับโมริเพราะโมริบอกว่าเอริทำอาหารไม่อร่อย (จากตอนท้ายของ Movie 2 : คดีฆาตกรรมไพ่ปริศนา ซึ่งรันได้ถามสาเหตุที่แท้จริงของการแยกกันอยู่ของพ่อกับแม่จากแม่ของเธอ) เธอสูง 175 ซม.หนัก 41.5 กก.',
    '       โคจิมะ เก็นตะ เก็นตะเรียนอยู่ที่โรงเรียนประถมเทย์ตัน มีเพื่อนร่วมชั้นได้แก่ โยชิดะ อายูมิ , เอโดงาวะ โคนัน , ซึบุรายะ มิซึฮิโกะ และ ไฮบาระ ไอ เก็นตะเป็นหัวหน้าของขบวนการนักสืบเยาวชน และชอบกินข้าวหน้าปลาไหล ถึงแม้ว่าเก็นตะจะเป็นหัวหน้าแต่ความฉลาดก็สู้โคนันไม่ได้เลย ลักษณะนิสัย เก็นตะเป็นคนตัวอ้วน เขาชอบกินอาหารมากมายโดยเฉพาะข้าวหน้าปลาไหล ถึงแม้ว่าเขาจะใจร้อน ปากกล้า และชอบคุกคาม แต่เขาก็ใจดีและพึ่งพาได้ เขาเป็นเพื่อนที่ดีของอายูมิและมิซึฮิโกะ',
    '       คุโด้ ยูกิโกะ ชื่อเดิม ฟุจิมิเนะ ยูกิโกะ แม่ของชินอิจิ เป็นดาราดังที่ประสบความสำเร็จตั้งแต่อายุ 20 ปี ปัจจุบันอยู่ที่ ลอสแอนเจลิสมีฉายาว่า ไนท์บารอนเนส ยูกิโกะชอบเรียก ชินอิจิว่า ชินจัง และดูท่าจะสนับสนุนเรื่องของรันและชินอิจิมาก เธอเคยเป็นเพื่อนกับ คิซากิ เอริ มาก่อน สมัยที่เรียนอยู่ที่เทตัน ยูกิโกะเคยเป็นเจ้าหญิงแห่งเทตันมาก่อนเนื่องจากว่า เป็นสาวน้อยน่ารักที่มีพรสวรรค์ในการแสดงละครเป็นเยี่ยม เพียงผลงานแรก ก็มีสื่อมวลชนทั่วโลกต่างก็จับตามอง ยูกิโกะมีเพื่อนที่รู้จักกันชื่อว่า ชารอน วินยาร์ด ทั้งสองคนเป็นลูกศิษย์ คุโรบะ โทอิจิ นักมายากลที่เป็นคู่ปรับกับยูซากุ ซึ่งคุโรบะ โทอิจิ ความจริงก็คือ พ่อของคุโรบะ ไคโตะ (จอมโจรคิด) นั่นเอง ถนัดการขับรถผาดโผนมาก',
    '       คุโด้ ยูซากุ พ่อของชินอิจิ มีภรรยาชื่อ ยูกิโกะ เขาเป็นผู้แต่งนิยายแนวนักสืบชื่อก้องโลก ซึ่งหนึ่งในเรื่องที่ขายดี คือ ไนท์บารอน เดิมทียูซากุได้ถูกทางเอฟบีไอ ขอร้องให้สืบเกี่ยวกับคดีของชายชุดดำ เมื่อตอนชินอิจิ ยังคงอยู่ในอเมริกาไปเที่ยว และยูซากุก็ได้แค่เริ่มโครงการโดยใช้ชื่อโค๊ดเนม ไนท์บารอน เท่านั้น แต่ได้เลิกล้มภารกิจนี้ไป จนเมื่อชินอิจิถูกย่อตัวเป็นโคนัน และได้มีการเกี่ยวข้องกับชายชุดดำ ยูซากุจึงได้ร่วมมือกับทางเอฟบีไอ อย่างลับๆเพื่อสืบหาหัวหน้าใหญ่ ในขณะที่คุโด้ ชินอิจิได้ล่อชายชุดดำออกมาให้เปิดเผยตัวมากขึ้น นอกจากนี้ เขายังเป็นคู่ปรับกับนักมายากลชื่อดัง คุโรบะ โทอิจิ เหมือนที่ชินอิจิกำลังเป็นคู่ปรับกับจอมโจรคิดอีกด้วย',
    '       คุโรบะ ไคโตะ เป็นลูกชายคนเดียวของคุโรบะ โทอิจิ ที่มีหน้าตาคล้ายคุโด้ ชินอิจิมาก โทอิจิคือนักมายากลชื่อก้องโลก คุโรบะ ไคโตะนั้นเป็นคิดรุ่น 2 ต่อจากพ่อของเขา มีความสามารถในการปลอมตัวทั้งเสียงและอุปนิสัยของคน ๆ นั้น ส่วนคุโระบะ โทอิจิที่เป็นคิดรุ่นแรก ว่ากันว่าเป็นอาจารย์สอนวิชาปลอมตัวให้กับแม่ของคุโด้และชารอน วินยาร์ด จอมโจรคิดในตอนแรกปรากฏในชื่อ จอมโจร 1412 ตัวเลข 1412 เป็นรหัสของเขา และคนที่ตั้งชื่อคิดขึ้นมาก็คือ คุโด้ ยูซากุ โดยเป็นการเล่นคำจากรหัส 1412 ที่เขียนด้วยลายมือของนักหนังสือพิมพ์',
    '       เมงูเระ จูโซ สารวัตรแห่งกองกำกับการสืบสวนสอบสวน 1 แผนกอาชญากรรม สูง 166 ซม. มักจะถูกเรียกว่าผู้กองปีศาจแห่งกรมตำรวจเป็นตำรวจที่เกลียดการใช้นกต่อที่สุด(รายละเอียดและสาเหตุอยู่ในตอนที่ 217-218 ความลับของเมงูเระที่ถูกผนึกไว้ หรือจากเล่มที่ 28-29) บ่อยครั้งที่ชินอิจิช่วยคลี่คลายคดีให้ แต่พอชินอิจิหายหน้าไปเขาก็ไปพึ่ง นักสืบโคโกโร่แทน ซึ่งโคโกโร่เคยเป็นลูกน้องสารวัตรมาก่อน ชอบทำให้สารวัตรคอยปวดหัวอยู่เรื่อยตอนโคโกโร่เป็นตำรวจและทำคดีร่วมกัน',
    '       มิยาโมโต้ ยูมิ เพื่อนตำรวจของซาโต้ มิวาโกะ อยู่แผนกจราจร เลี้ยงสุนัขสองตัวชื่อ สึตะ กับ ฮะจิ',
    '       โมริ โคโกโร่ เคยเป็นตำรวจมาก่อนที่จะลาออกมาเป็นนักสืบเอกชน เขามักเป็นคนที่หลงตัวเอง เจ้าชู้ และชอบเล่นไพ่นกกระจอก อย่างไรก็ตาม เขามีความสามารถในด้านยูโดและยิงปืน แต่เนื่องด้วยการวิเคราะห์คดีความที่ผิดพลาดอยู่บ่อยครั้ง เอโดกาวะ โคนัน จึงใช้ลูกดอกยาสลบขนาดเล็กยิงไปที่ท้ายทอยของโมริเพื่อให้สลบ แล้วใช้เสียงพากษ์ช่วยวิเคราะห์คดีให้อยู่บ่อยครั้ง นี่จึงเป็นที่มาของฉายา "โคโกโร่นิทรา" ที่คนทั่วไปรู้จักกันเป็นอย่างดี',
    '       โมริ รัน นักเรียนมัธยมปีที่ 5 โรงเรียนมัธยมปลายเทย์ตัน เป็นเพื่อนสมัยเด็กกับคุโด้ ชินอิจิ เป็นคนที่ชินอิจิแอบชอบ และรันเองก็ชอบชินอิจิด้วย เป็นลูกสาวของนักสืบโมริ โคโกโร่ และทนาย คิซากิ เอริ พ่อแม่ของรันแยกกันอยู่ตั้งแต่อายุ 7 ขวบ และเป้าหมายหลักของเธอคือต้องการให้พ่อ และ แม่ของเธอคืนดีกัน นอกจากชินอิจิแล้ว ซึซึกิ โซโนโกะ ที่เป็นเพื่อนร่วมห้อง ก็ยังเป็นเพื่อนรักของรันอีกด้วยหนึ่งปีก่อนที่เนื้อเรื่องจะเริ่มขึ้น รันกับชินอิจิได้ไปอเมริกา เพื่อที่จะไปเยี่ยมพ่อแม่ของชินอิจิที่นิวยอร์ก รันและชินอิจิได้พบกับชารอน วินยาร์ด หรือเบลม็อท ที่เป็นหนึ่งในสมาชิกขององค์กรชุดดำ ช่วงค่ำเบลม็อทได้ปลอมตัวเป็นฆาตกรโรคจิตแล้วเกือบจะพลัดตกลงจากตึก แต่รันและชินอิจิก็ได้ช่วยเอาไว้หลังจากที่ชินอิจิหายตัวไป รันก็ได้พบกับโคนัน ที่แนะนำโดย ดร.อากาสะ ฮิโรชิ โดยบอกว่าเป็นญาติห่างๆกัน โคนันจึงได้ไปอยู่ที่สำนักงานนักสืบโมริ แล้วรับไปเลี้ยงดู',
    '       นากาโมริ กินโซ เป็นตำรวจที่ค่อนข้างเซ่อ โดนจอมโจรคิดแหกตาทุกครั้งเวลาที่จอมโจรคิดโจรกรรม เกือบแพ้หมวด เดอลอง จากฝรั่งเศส ออกมาในจอมโจรอัจฉริยะเล่ม 2',
    '       ซึซึกิ โซโนโกะ  ลูกสาวคนที่สองของซึซึกิ ชิโรและโทโมโกะ เป็นเพื่อนรักของรัน โซโนโกะเป็นคนที่มีความมั่นใจสูง เป็นคนสบายๆ ง่ายๆ เธอชอบผู้ชายหล่อๆ และเป็นคนที่มีความพยายามในการหาแฟนสูง แต่ในที่สุดเธอก็ได้พบกับเคียวโกขุ มาโคโตะ(ภาคมังงะ เล่มที่ 22 ภาคอะนิเมะ ตอนที่ 153-154) โซโนโกะชอบถึงขนาดลงทุนเปลี่ยนมือถือใหม่ สูง 161 ซม.หนัก 49 กก.',
    '       ชิบะ เคย์จิ  เพื่อนตำรวจด้วยกันกับหมวดทาคางิ วาตารุ เคยเรียนอยู่ที่ โรงเรียนประถมเทตัน แอบชอบ มิอิเกะ นาโอโกะ เพื่อนในห้องเดียวกันที่ต่อมาได้เป็นตำรวจจราจร',
    '       ซึบุรายะ มิซึฮิโกะ  ซึบุรายะ มิซึฮิโกะ เป็นนักเรียนที่โรงเรียนประถมเทย์ตัน มีเพื่อนร่วมชั้นคือ เอโดงาวะ โคนัน , โยชิดะ อายูมิ , โคจิมะ เก็นตะ , ไฮบาระ ไอ เป็นคนที่ชื่นชอบการสืบสวน และชอบแย่งซีนสืบสวนแทนโคนันอยู่เรื่อย ทำให้เกิดปัญหาอยู่หลายครั้ง พ่อแม่ของเขานั้นเป็นครูทั้งคู่ และมีพี่สาวคนโตชื่อ ซึบุรายะ อาสะมิ อายุ 10 ปี',
    '       ชิราโทริ นินซาบุโร่ ปัจจุบันเป็นสารวัตร แต่มันสมองยังไม่ดีเท่าซาโต้กับทาคางิที่โคนันช่วยใบ้ให้แล้วเข้าใจได้อย่างรวดเร็ว และยังชอบซาโต้ มิวาโกะเอามากๆ แม่ของซาโต้มิวาโกะคอยเอาสมุดดูตัวให้ซาโต้เสมอ แต่ซาโต้เบื่อเอามากๆถึงขนาดเคยหยิบสมุดดูตัวออกมาเล่มหนึ่งด้วยนิ้วเท้ากันทีเดียว แต่เผอิญเล่มนั้นคือชิราโทริพอดี จึงทำให้ต้องไปดูตัวกับชิราโทริและชิราโทริก็เกือบจะได้ซาโต้ไปครองโดยที่ซาโต้มีใจให้ทาคางิเต็มเปี่ยม แต่ทาคางิก็มาไม่ทันแต่ได้โคนันช่วยจึงทำให้ซาโต้รอดตัวไป ชิราโทริพยามยามแย่ง ซาโต้ ไปจาก ทาคางิ แล้วแต่ ไม่ได้ผล จนมาวันหนึ่ง ชิราโทริเกิดซึมในตอนหลังจากการไขคดีหนึ่งไป จนอายูมิ มาปลอบใจแล้ว ให้กระดาษข้อมือที่ตัดเป็นรูปซากุระ และคำพูดของอายูมิ ทำให้ชิราโทริได้พบคนทีเป็นรักแท้จริงๆ นั่นก็ คือ คุณครู สุมิโกะ โคบายาชิ ซึ่งเป็นครูประจำห้องของพวกกลุ่มโคนันนั่นเอง',
    '       โคบายาชิ ซึมึโกะ คุณครูประจำชั้นห้อง ป.1 ห้อง B โรงเรียนประถมเทตัน เคยเจอกับสารวัตรชิราโทริที่ห้องสมุด และตอนนี้ทั้งสองคนก็ชอบพอกัน',
    '       ทาคางิ วาตารุ ผู้หมวดหนุ่มของกรมตำรวจ สูง 179 ซม. หลงรักผู้หมวดซาโต้และดูเหมือนอีกฝ่ายจะแอบชอบเขาเหมือนกัน แล้วได้จูบกับซาโต้ในที่สุด เป็นคนที่จริงใจ และเป็นคนซื่อ เขามักจะใช้การวิเคราะห์ของโคนันช่วยในการตัดสินคดีเสมอ เป็นคนจิตใจดีคนหนึ่ง',
    '       โทยามะ คาซึฮะ เพื่อนรุ่นเดียวกันเฮย์จิ และผูกพันกันตั้งแต่สมัยเด็ก เหมือนชินอิจิกับรัน ทั้งสองคนมีวีรกรรมที่เกี่ยวกับห้องน้ำ เฮย์จิและคาซึฮะนำโซ่กุญแจมือมาคล้องข้อมือแต่กลับหาลูกกุญแจไม่เจอเลยต้องเข้าห้องน้ำด้วยกัน (จากตอนที่118 คดีฆาตกรรมต่อเนื่องนานิวะ) คาซึฮะแอบชอบเฮย์จิด้วย และเธอก็ยังเป็นรักแรกของเฮย์จิ (จากโคนัน movie 7)',
    '       สารวัตรโทยามะ  คุณพ่อของคาซึฮะ เป็นลูกน้องของพ่อเฮย์จิ ฮัตโตริ เฮย์โซ มีตำแหน่งเป็นสารวัตรใหญ่',
    '       วอดก้า เป็นโค้ดเนมสมาชิกคนหนึ่งขององค์กรชุดดำ สวมแว่นดำอยู่ตลอดเวลา มักไปไหนมาไหนกับยีนเสมอ ปรากฏตัวครั้งแรกพร้อมยิน ในการทำธุรกรรมบางอย่าง ในคดีฆาตกรรมบนรถไฟเหาะ',
    '       ยิน เป็นคนที่ฉลาดมากคนหนึ่งในองค์กร เป็นคนเอาแคปซูลยาพิษ APTX4869 กรอกใส่ปากคุโด้ ชินอีจิ ยินเป็นคนที่รอบคอบ เยือกเย็น เจ้าเล่ห์ และเหี้ยมโหด มีรถเปอร์เช่สีดำเป็นสัญลักษณ์ประจำตัว ปรากฏตัวครั้งแรกพร้อมกับว็อดก้า (คดีฆาตกรรมบนรถไฟเหาะ หรือ มังงะ เล่มที่ 1)',
    '       โยชิดะ อายูมิ อายูมิ เป็นนักเรียนอายุ 7 ขวบ มีเพื่อนสนิทอยู่ 2 คน คือ ซึบุรายะ มึซึฮิโกะ กับโคจิมะ เก็นตะ แล้ววันหนึ่ง ก็มีเด็กคนหนึ่งชื่อ เอโดงาวะ โคนัน ย้ายเขามาเรียนที่โรงเรียนเดียวกัน หรือคุโด้ ชินอิจิในร่างเด็ก พอเลิกเรียนโคนนันก็เดินกลับบ้าน อายูมิจึงเดินไปชวนโคนันกับบ้านด้วยกัน และก็ยังบังคับให้เขากลุ่มนักสืบเยาวชน อีกด้วย เนื่องจากมีคดีหลายอย่างเขามาในชีวิตเด็ก เพราะองค์กรชุดดำจ้องเล่นงานโคนันอยู่ทำให้ไปเจอ อะไรๆๆ ทีอันตราย และเสี่ยงมากๆ โคนันจึงต้องช่วยพวกเด็กหลายอย่าง ทำให้อายูมิชอบ โคนัน แล้ววันหนึ่งมี เด็กอีกคนชื่อ ไฮบาระ ไอ(มิยาโนะ ชิโฮะ)หนึ่งในองค์กรชุดดำแต่หนีออกมาจากองค์กร จึงกินยา เหมือนที่ โคนันกินเขาไป แล้วจึงกลายมาเป็นเด็ก แล้วมาอยู่ที่โรงเรียนห้อง เดียวกับ โคนัน และ อายูมิ เก็นตะ มิสึฮิโกะ และเป็นเพื่อนกันกับทุกคนและกลายมาเป็นขบวนการนักสืบเยาวชนตอนนี้อยู่ที่บ้านดอกเตอร์ อากาสะ ฮิโรชิ (ไม่รู้ตัวจริงของโคนัน และไฮบาระ)',

   
  ];


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("ตัวละครหลัก"),
      ),
      body: Center(
        child: GridView.builder(
          primary: false,
          padding: const EdgeInsets.all(1),
          itemCount: myImageData.length,
          gridDelegate:
              new SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 3),
          itemBuilder: (BuildContext context, int index) {
            return Column(
              children: <Widget>[
                GestureDetector(
                  child: Hero(
                    tag: myImageData[index],
                    child: Image.asset(
                      'assets/image/' + myImageData[index],
                      height: 100,
                      width: 100,
                    ),
                  ),
                  onTap: () {
                    Navigator.push(
                      context,
                      MaterialPageRoute(builder: (_) {
                        return DetailScreen(
                          myImageData[index], nameThai[index], mytext[index]);
                      }),
                    );
                  },
                ),
                Text(nameThai[index]),
              ],
            );
          },
        ),
      ),
    );
  }
}

class DetailScreen extends StatelessWidget {
  final imageSrc, nameThai, mytext;
  DetailScreen(this.imageSrc, this.nameThai, this.mytext);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(nameThai),
      ),
      body: Column(
        children: <Widget>[
          GestureDetector(
            child: Hero(
              tag: imageSrc,
              child: Image.asset(
                'assets/image/' + imageSrc,
              ),
            ),
            onTap: () {
              Navigator.pop(context);
            },
          ),
          Text(mytext),
          
        ],
      ),
    );
  }
}
